;******************************************************************************
;* G3 TMS320C6x C/C++ Codegen                                     Unix v7.3.1 *
;* Date/Time created: Wed Oct  9 16:03:07 2013                                *
;******************************************************************************
	.compiler_opts --abi=eabi --c64p_l1d_workaround=default --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --object_format=elf --silicon_version=6510 --symdebug:dwarf --symdebug:dwarf_version=3 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : C6x - Tesla                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : 10                                                   *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Enabled                                              *

	.dwattr $C$DW$186, DW_AT_TI_begin_line(0x7b)
	.dwattr $C$DW$186, DW_AT_TI_end_line(0x7b)
$C$DW$187	.dwtag  DW_TAG_TI_loop_range
	.dwattr $C$DW$187, DW_AT_low_pc($C$DW$L$RPC_SKEL_GetHandle$6$B)
	.dwattr $C$DW$187, DW_AT_high_pc($C$DW$L$RPC_SKEL_GetHandle$6$E)
	.dwendtag $C$DW$186

	.dwattr $C$DW$172, DW_AT_TI_end_file("dsp.c")
	.dwattr $C$DW$172, DW_AT_TI_end_line(0xd7)
	.dwattr $C$DW$172, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$172

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".const:.string"
	.align	4
$C$SL1:	.string	"RPC_SKEL_GetHandle",0
	.align	4
$C$SL2:	.string	"RPC_SKEL_SetParameter",0
	.align	4
$C$SL3:	.string	"RPC_SKEL_GetParameter",0
	.align	4
$C$SL4:	.string	"fxnTest1",0
$C$SL5:	.string	"%s starting..",10,0
$C$SL6:	.string	"ti.ipc.rpmsg.MessageQCopy=EXLFS",0
$C$SL7:	.string	"OMX",0
$C$SL8:	.string	"Event create failed",0
$C$SL9:	.string	"OMX_Callback",0
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	xdc_runtime_Error_init__E
	.global	xdc_runtime_Diags_setMask__E
	.global	ti_sysbios_knl_Event_Object__create__S
	.global	xdc_runtime_System_abort__E
	.global	xdc_runtime_System_printf__E
	.global	MultiProc_getName
	.global	MultiProc_self
	.global	ti_sysbios_BIOS_start__E
	.global	RcmServer_Params_init
	.global	ServiceMgr_init
	.global	ServiceMgr_start
	.global	ServiceMgr_register
	.global	ServiceMgr_send
	.global	HwSpinlock_Params_init
	.global	HwSpinlock_create
	.global	HwSpinlock_delete
	.global	HwSpinlock_enter
	.global	HwSpinlock_leave
	.global	HwSpinlock_getId
	.global	start_ping_tasks
	.global	memset

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_Long_Precision_Bits(2)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "TI", Tag_File, 1, Tag_ABI_enum_size(2)
	.battr "c6xabi", Tag_File, 1, Tag_ABI_wchar_t(1)
	.battr "c6xabi", Tag_File, 1, Tag_ABI_array_object_alignment(0)
	.battr "c6xabi", Tag_File, 1, Tag_ABI_array_object_align_expected(0)
	.battr "c6xabi", Tag_File, 1, Tag_ABI_stack_align_needed(0)
	.battr "c6xabi", Tag_File, 1, Tag_ABI_stack_align_preserved(0)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$791	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$791, DW_AT_byte_size(0x04)
$C$DW$188	.dwtag  DW_TAG_enumerator, DW_AT_name("HwSpinlock_STATE_FREE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$188, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$188, DW_AT_decl_column(0x05)
$C$DW$189	.dwtag  DW_TAG_enumerator, DW_AT_name("HwSpinlock_STATE_TAKEN"), DW_AT_const_value(0x01)
	.dwattr $C$DW$189, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$189, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$791

	.dwattr $C$DW$T$791, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$791, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$791, DW_AT_decl_column(0x0e)
$C$DW$T$792	.dwtag  DW_TAG_typedef, DW_AT_name("HwSpinlock_State")
	.dwattr $C$DW$T$792, DW_AT_type(*$C$DW$T$791)
	.dwattr $C$DW$T$792, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$792, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$792, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$792, DW_AT_decl_column(0x03)

$C$DW$T$793	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$793, DW_AT_byte_size(0x04)
$C$DW$190	.dwtag  DW_TAG_enumerator, DW_AT_name("RPC_OMX_MAP_INFO_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$190, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$190, DW_AT_decl_line(0x56)
	.dwattr $C$DW$190, DW_AT_decl_column(0x05)
$C$DW$191	.dwtag  DW_TAG_enumerator, DW_AT_name("RPC_OMX_MAP_INFO_ONE_BUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$191, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$191, DW_AT_decl_line(0x57)
	.dwattr $C$DW$191, DW_AT_decl_column(0x05)
$C$DW$192	.dwtag  DW_TAG_enumerator, DW_AT_name("RPC_OMX_MAP_INFO_TWO_BUF"), DW_AT_const_value(0x02)
	.dwattr $C$DW$192, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$192, DW_AT_decl_line(0x58)
	.dwattr $C$DW$192, DW_AT_decl_column(0x05)
$C$DW$193	.dwtag  DW_TAG_enumerator, DW_AT_name("RPC_OMX_MAP_INFO_THREE_BUF"), DW_AT_const_value(0x03)
	.dwattr $C$DW$193, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$193, DW_AT_decl_line(0x59)
	.dwattr $C$DW$193, DW_AT_decl_column(0x05)
$C$DW$194	.dwtag  DW_TAG_enumerator, DW_AT_name("RPC_OMX_MAP_INFO_MAX"), DW_AT_const_value(0x7fffffff)
	.dwattr $C$DW$194, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$194, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$194, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$793

	.dwattr $C$DW$T$793, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$T$793, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$793, DW_AT_decl_column(0x0e)
$C$DW$T$794	.dwtag  DW_TAG_typedef, DW_AT_name("map_info_type")
	.dwattr $C$DW$T$794, DW_AT_type(*$C$DW$T$793)
	.dwattr $C$DW$T$794, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$794, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$T$794, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$794, DW_AT_decl_column(0x03)

$C$DW$T$216	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$216, DW_AT_byte_size(0x18)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$195, DW_AT_name("name")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0xde)
	.dwattr $C$DW$195, DW_AT_decl_column(0x0c)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$208)
	.dwattr $C$DW$196, DW_AT_name("count")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("count")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$196, DW_AT_decl_column(0x0a)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$197, DW_AT_name("priority")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("priority")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$197, DW_AT_decl_column(0x15)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$198, DW_AT_name("osPriority")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("osPriority")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$198, DW_AT_decl_column(0x09)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$215)
	.dwattr $C$DW$199, DW_AT_name("stackSize")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("stackSize")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$199, DW_AT_decl_column(0x0b)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$200, DW_AT_name("stackSeg")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("stackSeg")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$200, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$216

	.dwattr $C$DW$T$216, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$216, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$216, DW_AT_decl_column(0x10)
$C$DW$T$217	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_ThreadPoolDesc")
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$216)
	.dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$217, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$217, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$217, DW_AT_decl_column(0x03)
$C$DW$T$218	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$T$218, DW_AT_address_class(0x20)

$C$DW$T$219	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$219, DW_AT_byte_size(0x08)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$201, DW_AT_name("length")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x109)
	.dwattr $C$DW$201, DW_AT_decl_column(0x09)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$218)
	.dwattr $C$DW$202, DW_AT_name("elem")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$202, DW_AT_decl_column(0x1f)
	.dwendtag $C$DW$T$219

	.dwattr $C$DW$T$219, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$219, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$219, DW_AT_decl_column(0x10)
$C$DW$T$224	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_ThreadPoolDescAry")
	.dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$224, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$224, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$224, DW_AT_decl_column(0x03)

$C$DW$T$220	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$220, DW_AT_byte_size(0x08)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$203, DW_AT_name("name")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$203, DW_AT_decl_column(0x0c)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$275)
	.dwattr $C$DW$204, DW_AT_name("addr")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("addr")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$204, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$T$220

	.dwattr $C$DW$T$220, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$220, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$220, DW_AT_decl_column(0x10)
$C$DW$T$221	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_FxnDesc")
	.dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
	.dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$221, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$221, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$221, DW_AT_decl_column(0x03)
$C$DW$T$222	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$T$222, DW_AT_address_class(0x20)

$C$DW$T$798	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$798, DW_AT_type(*$C$DW$T$221)
	.dwattr $C$DW$T$798, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$798, DW_AT_byte_size(0x20)
$C$DW$205	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$205, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$798


$C$DW$T$223	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$223, DW_AT_byte_size(0x08)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$206, DW_AT_name("length")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$206, DW_AT_decl_column(0x09)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$222)
	.dwattr $C$DW$207, DW_AT_name("elem")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$207, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$223

	.dwattr $C$DW$T$223, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$223, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$223, DW_AT_decl_column(0x10)
$C$DW$T$225	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_FxnDescAry")
	.dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$223)
	.dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$225, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$225, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$T$225, DW_AT_decl_column(0x03)
$C$DW$T$800	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$800, DW_AT_type(*$C$DW$T$225)

$C$DW$T$226	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$226, DW_AT_byte_size(0x38)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$208, DW_AT_name("priority")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("priority")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x125)
	.dwattr $C$DW$208, DW_AT_decl_column(0x15)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$209, DW_AT_name("osPriority")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("osPriority")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x132)
	.dwattr $C$DW$209, DW_AT_decl_column(0x09)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$215)
	.dwattr $C$DW$210, DW_AT_name("stackSize")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("stackSize")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x137)
	.dwattr $C$DW$210, DW_AT_decl_column(0x0b)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$211, DW_AT_name("stackSeg")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("stackSeg")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$211, DW_AT_decl_column(0x0c)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$212, DW_AT_name("defaultPool")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("defaultPool")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x141)
	.dwattr $C$DW$212, DW_AT_decl_column(0x1e)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$224)
	.dwattr $C$DW$213, DW_AT_name("workerPools")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("workerPools")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$213, DW_AT_decl_column(0x21)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$225)
	.dwattr $C$DW$214, DW_AT_name("fxns")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("fxns")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$214, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$226

	.dwattr $C$DW$T$226, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$226, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$T$226, DW_AT_decl_column(0x10)
$C$DW$T$802	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_Params")
	.dwattr $C$DW$T$802, DW_AT_type(*$C$DW$T$226)
	.dwattr $C$DW$T$802, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$802, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$802, DW_AT_decl_line(0x170)
	.dwattr $C$DW$T$802, DW_AT_decl_column(0x03)
$C$DW$T$803	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$803, DW_AT_type(*$C$DW$T$802)
	.dwattr $C$DW$T$803, DW_AT_address_class(0x20)

$C$DW$T$231	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$231, DW_AT_byte_size(0x20)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$215, DW_AT_name("a")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$215, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$215, DW_AT_decl_column(0x0c)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$216, DW_AT_name("b")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("b")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$216, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$216, DW_AT_decl_column(0x0c)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$217, DW_AT_name("c")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$217, DW_AT_decl_line(0x60)
	.dwattr $C$DW$217, DW_AT_decl_column(0x0c)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$218, DW_AT_name("d")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("d")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$218, DW_AT_decl_line(0x61)
	.dwattr $C$DW$218, DW_AT_decl_column(0x0c)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$219, DW_AT_name("e")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("e")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$219, DW_AT_decl_line(0x62)
	.dwattr $C$DW$219, DW_AT_decl_column(0x0c)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$220, DW_AT_name("f")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$220, DW_AT_decl_line(0x63)
	.dwattr $C$DW$220, DW_AT_decl_column(0x0c)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$221, DW_AT_name("start_indx")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("start_indx")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$221, DW_AT_decl_line(0x64)
	.dwattr $C$DW$221, DW_AT_decl_column(0x0c)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$222, DW_AT_name("end_indx")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("end_indx")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$222, DW_AT_decl_line(0x65)
	.dwattr $C$DW$222, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$231

	.dwattr $C$DW$T$231, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$T$231, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$231, DW_AT_decl_column(0x10)
$C$DW$T$804	.dwtag  DW_TAG_typedef, DW_AT_name("FxnArgs")
	.dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$231)
	.dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$804, DW_AT_decl_file("dsp.c")
	.dwattr $C$DW$T$804, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$804, DW_AT_decl_column(0x03)

$C$DW$T$234	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$234, DW_AT_byte_size(0x08)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$223, DW_AT_name("length")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$223, DW_AT_decl_column(0x16)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$224, DW_AT_name("elem")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$224, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$234

	.dwattr $C$DW$T$234, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$234, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$234, DW_AT_decl_column(0x10)
$C$DW$T$805	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$234)
	.dwattr $C$DW$T$805, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$805, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$805, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$805, DW_AT_decl_column(0x42)
$C$DW$T$806	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$806, DW_AT_type(*$C$DW$T$805)
	.dwattr $C$DW$T$806, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$806, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$806, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$806, DW_AT_decl_column(0x2b)
$C$DW$T$807	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$807, DW_AT_type(*$C$DW$T$806)
	.dwattr $C$DW$T$807, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$807, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$807, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$807, DW_AT_decl_column(0x27)

$C$DW$T$237	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$237, DW_AT_byte_size(0x08)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$225, DW_AT_name("length")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x195)
	.dwattr $C$DW$225, DW_AT_decl_column(0x16)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$236)
	.dwattr $C$DW$226, DW_AT_name("elem")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x195)
	.dwattr $C$DW$226, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$237

	.dwattr $C$DW$T$237, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$237, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$237, DW_AT_decl_column(0x10)
$C$DW$T$808	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$808, DW_AT_type(*$C$DW$T$237)
	.dwattr $C$DW$T$808, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$808, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$808, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$808, DW_AT_decl_column(0x43)
$C$DW$T$809	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$809, DW_AT_type(*$C$DW$T$808)
	.dwattr $C$DW$T$809, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$809, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$809, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$809, DW_AT_decl_column(0x2c)
$C$DW$T$810	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$810, DW_AT_type(*$C$DW$T$809)
	.dwattr $C$DW$T$810, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$810, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$810, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$810, DW_AT_decl_column(0x28)

$C$DW$T$247	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$247, DW_AT_byte_size(0x14)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$227, DW_AT_name("poolId")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("poolId")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$227, DW_AT_decl_column(0x11)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$228, DW_AT_name("jobId")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("jobId")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$228, DW_AT_decl_column(0x11)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$229, DW_AT_name("fxnIdx")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("fxnIdx")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$229, DW_AT_decl_column(0x11)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$245)
	.dwattr $C$DW$230, DW_AT_name("result")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("result")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$230, DW_AT_decl_column(0x11)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$231, DW_AT_name("dataSize")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("dataSize")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$231, DW_AT_decl_column(0x11)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$246)
	.dwattr $C$DW$232, DW_AT_name("data")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("data")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$232, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$247

	.dwattr $C$DW$T$247, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$247, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$T$247, DW_AT_decl_column(0x10)
$C$DW$T$257	.dwtag  DW_TAG_typedef, DW_AT_name("RcmClient_Message")
	.dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$247)
	.dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$257, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$257, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$T$257, DW_AT_decl_column(0x03)
$C$DW$T$811	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$811, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$T$811, DW_AT_address_class(0x20)

$C$DW$T$250	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$250, DW_AT_byte_size(0x04)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$233, DW_AT_name("heapId")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("heapId")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$233, DW_AT_decl_column(0x0c)
$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$249)
	.dwattr $C$DW$234, DW_AT_name("callbackNotification")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("callbackNotification")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$234, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$250

	.dwattr $C$DW$T$250, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$250, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$T$250, DW_AT_decl_column(0x10)
$C$DW$T$812	.dwtag  DW_TAG_typedef, DW_AT_name("RcmClient_Params")
	.dwattr $C$DW$T$812, DW_AT_type(*$C$DW$T$250)
	.dwattr $C$DW$T$812, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$812, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$812, DW_AT_decl_line(0x20e)
	.dwattr $C$DW$T$812, DW_AT_decl_column(0x03)

$C$DW$T$254	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$254, DW_AT_byte_size(0x34)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$235, DW_AT_name("_f1")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x218)
	.dwattr $C$DW$235, DW_AT_decl_column(0x29)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$236, DW_AT_name("_f2")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x219)
	.dwattr $C$DW$236, DW_AT_decl_column(0x19)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$237, DW_AT_name("_f3")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_f3")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x21a)
	.dwattr $C$DW$237, DW_AT_decl_column(0x19)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$238, DW_AT_name("_f4")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_f4")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$238, DW_AT_decl_column(0x19)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$239, DW_AT_name("_f5")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_f5")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x21c)
	.dwattr $C$DW$239, DW_AT_decl_column(0x19)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$240, DW_AT_name("_f6")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_f6")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x21d)
	.dwattr $C$DW$240, DW_AT_decl_column(0x19)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$249)
	.dwattr $C$DW$241, DW_AT_name("_f7")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_f7")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x21e)
	.dwattr $C$DW$241, DW_AT_decl_column(0x19)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$242, DW_AT_name("_f8")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_f8")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x21f)
	.dwattr $C$DW$242, DW_AT_decl_column(0x19)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$243, DW_AT_name("_f9")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_f9")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x220)
	.dwattr $C$DW$243, DW_AT_decl_column(0x19)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$244, DW_AT_name("_f10")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_f10")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x221)
	.dwattr $C$DW$244, DW_AT_decl_column(0x19)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$245, DW_AT_name("_f11")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_f11")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x222)
	.dwattr $C$DW$245, DW_AT_decl_column(0x19)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$246, DW_AT_name("_f12")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_f12")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x223)
	.dwattr $C$DW$246, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$254

	.dwattr $C$DW$T$254, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$254, DW_AT_decl_line(0x217)
	.dwattr $C$DW$T$254, DW_AT_decl_column(0x10)
$C$DW$T$813	.dwtag  DW_TAG_typedef, DW_AT_name("RcmClient_Struct")
	.dwattr $C$DW$T$813, DW_AT_type(*$C$DW$T$254)
	.dwattr $C$DW$T$813, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$813, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$813, DW_AT_decl_line(0x224)
	.dwattr $C$DW$T$813, DW_AT_decl_column(0x03)

$C$DW$T$258	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$258, DW_AT_byte_size(0x2c)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$256)
	.dwattr $C$DW$247, DW_AT_name("reserved0")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("reserved0")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x75)
	.dwattr $C$DW$247, DW_AT_decl_column(0x18)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$256)
	.dwattr $C$DW$248, DW_AT_name("reserved1")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("reserved1")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x76)
	.dwattr $C$DW$248, DW_AT_decl_column(0x18)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$784)
	.dwattr $C$DW$249, DW_AT_name("hdr")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("hdr")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x77)
	.dwattr $C$DW$249, DW_AT_decl_column(0x1a)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$250, DW_AT_name("desc")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("desc")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x78)
	.dwattr $C$DW$250, DW_AT_decl_column(0x18)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$251, DW_AT_name("msgId")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("msgId")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x79)
	.dwattr $C$DW$251, DW_AT_decl_column(0x18)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$252, DW_AT_name("message")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("message")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$252, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$258

	.dwattr $C$DW$T$258, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$T$258, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$258, DW_AT_decl_column(0x10)
$C$DW$T$814	.dwtag  DW_TAG_typedef, DW_AT_name("RcmClient_Packet")
	.dwattr $C$DW$T$814, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$T$814, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$814, DW_AT_decl_file("../../../ti/grcm/RcmTypes.h")
	.dwattr $C$DW$T$814, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$814, DW_AT_decl_column(0x03)

$C$DW$T$259	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$259, DW_AT_byte_size(0x08)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$253, DW_AT_name("_f1")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x186)
	.dwattr $C$DW$253, DW_AT_decl_column(0x11)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$254, DW_AT_name("_f2")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x187)
	.dwattr $C$DW$254, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$259

	.dwattr $C$DW$T$259, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$259, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$259, DW_AT_decl_column(0x0c)

$C$DW$T$262	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$262, DW_AT_byte_size(0x70)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$255, DW_AT_name("_f1")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_f1")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$255, DW_AT_decl_column(0x19)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$256, DW_AT_name("_f2")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_f2")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$256, DW_AT_decl_column(0x19)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$257, DW_AT_name("_f3a")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_f3a")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$257, DW_AT_decl_column(0x19)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$258, DW_AT_name("_f3b")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_f3b")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$258, DW_AT_decl_column(0x19)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$259, DW_AT_name("_f3c")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_f3c")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$259, DW_AT_decl_column(0x19)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$230)
	.dwattr $C$DW$260, DW_AT_name("_f3d")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_f3d")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0x180)
	.dwattr $C$DW$260, DW_AT_decl_column(0x19)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$261, DW_AT_name("_f4")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_f4")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0x184)
	.dwattr $C$DW$261, DW_AT_decl_column(0x19)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$259)
	.dwattr $C$DW$262, DW_AT_name("_f5")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_f5")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x188)
	.dwattr $C$DW$262, DW_AT_decl_column(0x19)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$263, DW_AT_name("_f6")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_f6")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0x189)
	.dwattr $C$DW$263, DW_AT_decl_column(0x19)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$264, DW_AT_name("_f7")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_f7")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0x18a)
	.dwattr $C$DW$264, DW_AT_decl_column(0x19)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$265, DW_AT_name("_f8")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_f8")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$265, DW_AT_decl_column(0x19)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$249)
	.dwattr $C$DW$266, DW_AT_name("_f9")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_f9")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$266, DW_AT_decl_column(0x19)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$267, DW_AT_name("_f10")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_f10")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$267, DW_AT_decl_column(0x19)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$261)
	.dwattr $C$DW$268, DW_AT_name("_f11")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_f11")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x18e)
	.dwattr $C$DW$268, DW_AT_decl_column(0x19)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$253)
	.dwattr $C$DW$269, DW_AT_name("_f12")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_f12")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$269, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$262

	.dwattr $C$DW$T$262, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$262, DW_AT_decl_line(0x179)
	.dwattr $C$DW$T$262, DW_AT_decl_column(0x10)
$C$DW$T$815	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_Struct")
	.dwattr $C$DW$T$815, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$815, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$815, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$815, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$815, DW_AT_decl_column(0x03)

$C$DW$T$264	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$264, DW_AT_byte_size(0x18)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$270, DW_AT_name("fd")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("fd")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x48)
	.dwattr $C$DW$270, DW_AT_decl_column(0x0b)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$263)
	.dwattr $C$DW$271, DW_AT_name("buf")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x49)
	.dwattr $C$DW$271, DW_AT_decl_column(0x16)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$263)
	.dwattr $C$DW$272, DW_AT_name("pos")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("pos")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$272, DW_AT_decl_column(0x16)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$263)
	.dwattr $C$DW$273, DW_AT_name("bufend")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("bufend")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$273, DW_AT_decl_column(0x16)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$263)
	.dwattr $C$DW$274, DW_AT_name("buff_stop")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("buff_stop")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$274, DW_AT_decl_column(0x16)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$275, DW_AT_name("flags")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$275, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$264

	.dwattr $C$DW$T$264, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$T$264, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$264, DW_AT_decl_column(0x10)
$C$DW$T$816	.dwtag  DW_TAG_typedef, DW_AT_name("FILE")
	.dwattr $C$DW$T$816, DW_AT_type(*$C$DW$T$264)
	.dwattr $C$DW$T$816, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$816, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdio.h")
	.dwattr $C$DW$T$816, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$816, DW_AT_decl_column(0x03)

$C$DW$T$265	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$265, DW_AT_byte_size(0x08)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$276, DW_AT_name("quot")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$276, DW_AT_decl_column(0x16)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$277, DW_AT_name("rem")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$277, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$265

	.dwattr $C$DW$T$265, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$T$265, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$265, DW_AT_decl_column(0x10)
$C$DW$T$817	.dwtag  DW_TAG_typedef, DW_AT_name("div_t")
	.dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$265)
	.dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$817, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$T$817, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$817, DW_AT_decl_column(0x23)

$C$DW$T$266	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$266, DW_AT_byte_size(0x08)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$278, DW_AT_name("quot")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$278, DW_AT_decl_column(0x17)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$279, DW_AT_name("rem")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$279, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$266

	.dwattr $C$DW$T$266, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$T$266, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$266, DW_AT_decl_column(0x10)
$C$DW$T$818	.dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$818, DW_AT_type(*$C$DW$T$266)
	.dwattr $C$DW$T$818, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$818, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$T$818, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$818, DW_AT_decl_column(0x24)

$C$DW$T$267	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$267, DW_AT_byte_size(0x10)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$280, DW_AT_name("quot")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x42)
	.dwattr $C$DW$280, DW_AT_decl_column(0x1c)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$281, DW_AT_name("rem")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x42)
	.dwattr $C$DW$281, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$267

	.dwattr $C$DW$T$267, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$T$267, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$267, DW_AT_decl_column(0x10)
$C$DW$T$819	.dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$819, DW_AT_type(*$C$DW$T$267)
	.dwattr $C$DW$T$819, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$819, DW_AT_decl_file("/opt/ti/ccsv5/tools/compiler/c6000/include/stdlib.h")
	.dwattr $C$DW$T$819, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$819, DW_AT_decl_column(0x29)

$C$DW$T$275	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$275, DW_AT_byte_size(0x04)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$271)
	.dwattr $C$DW$282, DW_AT_name("fxn")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("fxn")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$282, DW_AT_decl_column(0x21)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$274)
	.dwattr $C$DW$283, DW_AT_name("createFxn")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("createFxn")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$283, DW_AT_decl_column(0x21)
	.dwendtag $C$DW$T$275

	.dwattr $C$DW$T$275, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$275, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$275, DW_AT_decl_column(0x0c)

$C$DW$T$786	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$786, DW_AT_name("HwSpinlock_Key")
	.dwattr $C$DW$T$786, DW_AT_byte_size(0x08)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$785)
	.dwattr $C$DW$284, DW_AT_name("key")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("key")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x80)
	.dwattr $C$DW$284, DW_AT_decl_column(0x0a)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$249)
	.dwattr $C$DW$285, DW_AT_name("valid")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("valid")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x81)
	.dwattr $C$DW$285, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$786

	.dwattr $C$DW$T$786, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$786, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$T$786, DW_AT_decl_column(0x10)
$C$DW$T$1067	.dwtag  DW_TAG_typedef, DW_AT_name("HwSpinlock_Key")
	.dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$786)
	.dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1067, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$1067, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$1067, DW_AT_decl_column(0x03)
$C$DW$T$1068	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$1067)
	.dwattr $C$DW$T$1068, DW_AT_address_class(0x20)
$C$DW$T$2576	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$2576, DW_AT_type(*$C$DW$T$1068)

$C$DW$T$202	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$202, DW_AT_name("HwSpinlock_Object")
	.dwattr $C$DW$T$202, DW_AT_declaration
	.dwendtag $C$DW$T$202

	.dwattr $C$DW$T$202, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$202, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$202, DW_AT_decl_column(0x10)
$C$DW$T$1065	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$202)
	.dwattr $C$DW$T$1065, DW_AT_address_class(0x20)
$C$DW$T$1066	.dwtag  DW_TAG_typedef, DW_AT_name("HwSpinlock_Handle")
	.dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$1065)
	.dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1066, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$1066, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$1066, DW_AT_decl_column(0x23)
$C$DW$T$1071	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$1066)
	.dwattr $C$DW$T$1071, DW_AT_address_class(0x20)
$C$DW$T$2582	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$2582, DW_AT_type(*$C$DW$T$1071)

$C$DW$T$790	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$790, DW_AT_name("HwSpinlock_Params")
	.dwattr $C$DW$T$790, DW_AT_byte_size(0x14)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$286, DW_AT_name("id")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x75)
	.dwattr $C$DW$286, DW_AT_decl_column(0x1b)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$789)
	.dwattr $C$DW$287, DW_AT_name("reqFxn")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("reqFxn")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x76)
	.dwattr $C$DW$287, DW_AT_decl_column(0x1b)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$789)
	.dwattr $C$DW$288, DW_AT_name("relFxn")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("relFxn")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x77)
	.dwattr $C$DW$288, DW_AT_decl_column(0x1b)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$289, DW_AT_name("arg1")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("arg1")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x78)
	.dwattr $C$DW$289, DW_AT_decl_column(0x1c)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$290, DW_AT_name("arg2")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("arg2")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x79)
	.dwattr $C$DW$290, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$790

	.dwattr $C$DW$T$790, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$790, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$790, DW_AT_decl_column(0x10)
$C$DW$T$1061	.dwtag  DW_TAG_typedef, DW_AT_name("HwSpinlock_Params")
	.dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$790)
	.dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1061, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$1061, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$1061, DW_AT_decl_column(0x03)
$C$DW$T$1062	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
	.dwattr $C$DW$T$1062, DW_AT_address_class(0x20)

$C$DW$T$1537	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1537, DW_AT_name("HwSpinlock_PreemptGate")
	.dwattr $C$DW$T$1537, DW_AT_byte_size(0x04)
$C$DW$291	.dwtag  DW_TAG_enumerator, DW_AT_name("HwSpinlock_PreemptGate_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$291, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x69)
	.dwattr $C$DW$291, DW_AT_decl_column(0x05)
$C$DW$292	.dwtag  DW_TAG_enumerator, DW_AT_name("HwSpinlock_PreemptGate_HWI"), DW_AT_const_value(0x01)
	.dwattr $C$DW$292, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$292, DW_AT_decl_column(0x05)
$C$DW$293	.dwtag  DW_TAG_enumerator, DW_AT_name("HwSpinlock_PreemptGate_SWI"), DW_AT_const_value(0x02)
	.dwattr $C$DW$293, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$293, DW_AT_decl_column(0x05)
$C$DW$294	.dwtag  DW_TAG_enumerator, DW_AT_name("HwSpinlock_PreemptGate_TASK"), DW_AT_const_value(0x03)
	.dwattr $C$DW$294, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$294, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1537

	.dwattr $C$DW$T$1537, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$1537, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$1537, DW_AT_decl_column(0x0e)
$C$DW$T$1538	.dwtag  DW_TAG_typedef, DW_AT_name("HwSpinlock_PreemptGate")
	.dwattr $C$DW$T$1538, DW_AT_type(*$C$DW$T$1537)
	.dwattr $C$DW$T$1538, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1538, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$1538, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$1538, DW_AT_decl_column(0x03)

$C$DW$T$152	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$152, DW_AT_name("MessageQCopy_Object")
	.dwattr $C$DW$T$152, DW_AT_declaration
	.dwendtag $C$DW$T$152

	.dwattr $C$DW$T$152, DW_AT_decl_file("../../../ti/ipc/rpmsg/MessageQCopy.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x10)
$C$DW$T$2344	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$2344, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$T$2344, DW_AT_address_class(0x20)
$C$DW$T$2345	.dwtag  DW_TAG_typedef, DW_AT_name("MessageQCopy_Handle")
	.dwattr $C$DW$T$2345, DW_AT_type(*$C$DW$T$2344)
	.dwattr $C$DW$T$2345, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$2345, DW_AT_decl_file("../../../ti/ipc/rpmsg/MessageQCopy.h")
	.dwattr $C$DW$T$2345, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$2345, DW_AT_decl_column(0x25)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("RcmClient_Object_tag")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1900	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1900, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1900, DW_AT_address_class(0x20)
$C$DW$T$1901	.dwtag  DW_TAG_typedef, DW_AT_name("RcmClient_Handle")
	.dwattr $C$DW$T$1901, DW_AT_type(*$C$DW$T$1900)
	.dwattr $C$DW$T$1901, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1901, DW_AT_decl_file("../../../ti/grcm/RcmClient.h")
	.dwattr $C$DW$T$1901, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$1901, DW_AT_decl_column(0x26)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("RcmServer_Object_tag")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$1056	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1056, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$1056, DW_AT_address_class(0x20)
$C$DW$T$1057	.dwtag  DW_TAG_typedef, DW_AT_name("RcmServer_Handle")
	.dwattr $C$DW$T$1057, DW_AT_type(*$C$DW$T$1056)
	.dwattr $C$DW$T$1057, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1057, DW_AT_decl_file("../../../ti/grcm/RcmServer.h")
	.dwattr $C$DW$T$1057, DW_AT_decl_line(0x116)
	.dwattr $C$DW$T$1057, DW_AT_decl_column(0x26)
$C$DW$T$1058	.dwtag  DW_TAG_typedef, DW_AT_name("Service_Handle")
	.dwattr $C$DW$T$1058, DW_AT_type(*$C$DW$T$1057)
	.dwattr $C$DW$T$1058, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1058, DW_AT_decl_file("../../../ti/srvmgr/ServiceMgr.h")
	.dwattr $C$DW$T$1058, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$1058, DW_AT_decl_column(0x1b)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$787	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$787, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$787, DW_AT_language(DW_LANG_C)
$C$DW$295	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$787

$C$DW$T$788	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$788, DW_AT_type(*$C$DW$T$787)
	.dwattr $C$DW$T$788, DW_AT_address_class(0x20)
$C$DW$T$789	.dwtag  DW_TAG_typedef, DW_AT_name("HwSpinlock_hookFxn")
	.dwattr $C$DW$T$789, DW_AT_type(*$C$DW$T$788)
	.dwattr $C$DW$T$789, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$789, DW_AT_decl_file("../../../ti/gates/hwspinlock/HwSpinlock.h")
	.dwattr $C$DW$T$789, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$789, DW_AT_decl_column(0x12)
$C$DW$T$824	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$824, DW_AT_type(*$C$DW$T$3)
$C$DW$T$252	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_Ptr")
	.dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$252, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/std.h")
	.dwattr $C$DW$T$252, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$252, DW_AT_decl_column(0x1a)
$C$DW$T$825	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_Module__gateObj")
	.dwattr $C$DW$T$825, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$825, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$825, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$825, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$825, DW_AT_decl_column(0x11)
$C$DW$T$826	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_Module__gatePrms")
	.dwattr $C$DW$T$826, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$826, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$826, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$826, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$826, DW_AT_decl_column(0x11)
$C$DW$T$827	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_Module__loggerObj")
	.dwattr $C$DW$T$827, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$827, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$827, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$827, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$827, DW_AT_decl_column(0x11)
$C$DW$T$828	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_Object__table")
	.dwattr $C$DW$T$828, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$828, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$828, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$828, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$828, DW_AT_decl_column(0x11)
$C$DW$T$829	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Module__gateObj")
	.dwattr $C$DW$T$829, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$829, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$829, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$829, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$829, DW_AT_decl_column(0x11)
$C$DW$T$830	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Module__gatePrms")
	.dwattr $C$DW$T$830, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$830, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$830, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$830, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$T$830, DW_AT_decl_column(0x11)
$C$DW$T$831	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Module__loggerObj")
	.dwattr $C$DW$T$831, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$831, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$831, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$831, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$831, DW_AT_decl_column(0x11)
$C$DW$T$832	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Object__table")
	.dwattr $C$DW$T$832, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$832, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$832, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$832, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$832, DW_AT_decl_column(0x11)
$C$DW$T$833	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_CacheProxy_Module__gateObj")
	.dwattr $C$DW$T$833, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$833, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$833, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Cache_CacheProxy.h")
	.dwattr $C$DW$T$833, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$833, DW_AT_decl_column(0x11)
$C$DW$T$834	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_CacheProxy_Module__gatePrms")
	.dwattr $C$DW$T$834, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$834, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$834, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Cache_CacheProxy.h")
	.dwattr $C$DW$T$834, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$834, DW_AT_decl_column(0x11)
$C$DW$T$835	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_CacheProxy_Module__loggerObj")
	.dwattr $C$DW$T$835, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$835, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$835, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Cache_CacheProxy.h")
	.dwattr $C$DW$T$835, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$835, DW_AT_decl_column(0x11)
$C$DW$T$836	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_CacheProxy_Object__table")
	.dwattr $C$DW$T$836, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$836, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$836, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Cache_CacheProxy.h")
	.dwattr $C$DW$T$836, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$836, DW_AT_decl_column(0x11)
$C$DW$T$837	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_Module__gateObj")
	.dwattr $C$DW$T$837, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$837, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$837, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Cache.h")
	.dwattr $C$DW$T$837, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$837, DW_AT_decl_column(0x11)
$C$DW$T$838	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_Module__gatePrms")
	.dwattr $C$DW$T$838, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$838, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$838, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Cache.h")
	.dwattr $C$DW$T$838, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$838, DW_AT_decl_column(0x11)
$C$DW$T$839	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_Module__loggerObj")
	.dwattr $C$DW$T$839, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$839, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$839, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Cache.h")
	.dwattr $C$DW$T$839, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$839, DW_AT_decl_column(0x11)
$C$DW$T$840	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Cache_Object__table")
	.dwattr $C$DW$T$840, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$840, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$840, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Cache.h")
	.dwattr $C$DW$T$840, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$840, DW_AT_decl_column(0x11)
$C$DW$T$841	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_Module__gateObj")
	.dwattr $C$DW$T$841, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$841, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$841, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Timer.h")
	.dwattr $C$DW$T$841, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$841, DW_AT_decl_column(0x11)
$C$DW$T$842	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_Module__gatePrms")
	.dwattr $C$DW$T$842, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$842, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$842, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Timer.h")
	.dwattr $C$DW$T$842, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$T$842, DW_AT_decl_column(0x11)
$C$DW$T$843	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_Module__loggerObj")
	.dwattr $C$DW$T$843, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$843, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$843, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Timer.h")
	.dwattr $C$DW$T$843, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$843, DW_AT_decl_column(0x11)
$C$DW$T$844	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_Object__table")
	.dwattr $C$DW$T$844, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$844, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$844, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/Timer.h")
	.dwattr $C$DW$T$844, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$T$844, DW_AT_decl_column(0x11)
$C$DW$T$845	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_TimerProxy_Module__gateObj")
	.dwattr $C$DW$T$845, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$845, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$845, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Timer_TimerProxy.h")
	.dwattr $C$DW$T$845, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$845, DW_AT_decl_column(0x11)
$C$DW$T$846	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_TimerProxy_Module__gatePrms")
	.dwattr $C$DW$T$846, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$846, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$846, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Timer_TimerProxy.h")
	.dwattr $C$DW$T$846, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$846, DW_AT_decl_column(0x11)
$C$DW$T$847	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_TimerProxy_Module__loggerObj")
	.dwattr $C$DW$T$847, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$847, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$847, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Timer_TimerProxy.h")
	.dwattr $C$DW$T$847, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$847, DW_AT_decl_column(0x11)
$C$DW$T$848	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_hal_Timer_TimerProxy_Object__table")
	.dwattr $C$DW$T$848, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$848, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$848, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/hal/package/Timer_TimerProxy.h")
	.dwattr $C$DW$T$848, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$848, DW_AT_decl_column(0x11)
$C$DW$T$849	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Clock_Module__gateObj")
	.dwattr $C$DW$T$849, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$849, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$849, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$849, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$849, DW_AT_decl_column(0x11)
$C$DW$T$850	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Clock_Module__gatePrms")
	.dwattr $C$DW$T$850, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$850, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$850, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$850, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$850, DW_AT_decl_column(0x11)
$C$DW$T$851	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Clock_Module__loggerObj")
	.dwattr $C$DW$T$851, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$851, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$851, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$851, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$851, DW_AT_decl_column(0x11)
$C$DW$T$852	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Clock_Object__table")
	.dwattr $C$DW$T$852, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$852, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$852, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$852, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$852, DW_AT_decl_column(0x11)
$C$DW$T$853	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Event_Module__gateObj")
	.dwattr $C$DW$T$853, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$853, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$853, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$853, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$853, DW_AT_decl_column(0x11)
$C$DW$T$854	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Event_Module__gatePrms")
	.dwattr $C$DW$T$854, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$854, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$854, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$854, DW_AT_decl_line(0xde)
	.dwattr $C$DW$T$854, DW_AT_decl_column(0x11)
$C$DW$T$855	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Event_Module__loggerObj")
	.dwattr $C$DW$T$855, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$855, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$855, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$855, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$855, DW_AT_decl_column(0x11)
$C$DW$T$856	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Event_Object__table")
	.dwattr $C$DW$T$856, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$856, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$856, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$856, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$856, DW_AT_decl_column(0x11)
$C$DW$T$857	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Queue_Module__gateObj")
	.dwattr $C$DW$T$857, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$857, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$857, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$857, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$857, DW_AT_decl_column(0x11)
$C$DW$T$858	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Queue_Module__gatePrms")
	.dwattr $C$DW$T$858, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$858, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$858, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$858, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$858, DW_AT_decl_column(0x11)
$C$DW$T$859	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Queue_Module__loggerObj")
	.dwattr $C$DW$T$859, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$859, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$859, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$859, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$859, DW_AT_decl_column(0x11)
$C$DW$T$860	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Queue_Object__table")
	.dwattr $C$DW$T$860, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$860, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$860, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$860, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$860, DW_AT_decl_column(0x11)
$C$DW$T$861	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Module__gateObj")
	.dwattr $C$DW$T$861, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$861, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$861, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$861, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$861, DW_AT_decl_column(0x11)
$C$DW$T$862	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Module__gatePrms")
	.dwattr $C$DW$T$862, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$862, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$862, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$862, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$862, DW_AT_decl_column(0x11)
$C$DW$T$863	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Module__loggerObj")
	.dwattr $C$DW$T$863, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$863, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$863, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$863, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$863, DW_AT_decl_column(0x11)
$C$DW$T$864	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Object__table")
	.dwattr $C$DW$T$864, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$864, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$864, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$864, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$T$864, DW_AT_decl_column(0x11)
$C$DW$T$865	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_Module__gateObj")
	.dwattr $C$DW$T$865, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$865, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$865, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$865, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$865, DW_AT_decl_column(0x11)
$C$DW$T$866	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_Module__gatePrms")
	.dwattr $C$DW$T$866, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$866, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$866, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$866, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$866, DW_AT_decl_column(0x11)
$C$DW$T$867	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_Module__loggerObj")
	.dwattr $C$DW$T$867, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$867, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$867, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$867, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$867, DW_AT_decl_column(0x11)
$C$DW$T$868	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_Object__table")
	.dwattr $C$DW$T$868, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$868, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$868, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$868, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$T$868, DW_AT_decl_column(0x11)
$C$DW$T$869	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_Module__gateObj")
	.dwattr $C$DW$T$869, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$869, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$869, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$869, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$869, DW_AT_decl_column(0x11)
$C$DW$T$870	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_Module__gatePrms")
	.dwattr $C$DW$T$870, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$870, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$870, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$870, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$870, DW_AT_decl_column(0x11)
$C$DW$T$871	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_Module__loggerObj")
	.dwattr $C$DW$T$871, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$871, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$871, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$871, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$871, DW_AT_decl_column(0x11)
$C$DW$T$872	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_Object__table")
	.dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$872, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$872, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$T$872, DW_AT_decl_column(0x11)
$C$DW$T$873	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Module__gateObj")
	.dwattr $C$DW$T$873, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$873, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$873, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$873, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$873, DW_AT_decl_column(0x11)
$C$DW$T$874	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Module__gatePrms")
	.dwattr $C$DW$T$874, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$874, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$874, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$874, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$874, DW_AT_decl_column(0x11)
$C$DW$T$875	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Module__loggerObj")
	.dwattr $C$DW$T$875, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$875, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$875, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$875, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$875, DW_AT_decl_column(0x11)
$C$DW$T$876	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Object__table")
	.dwattr $C$DW$T$876, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$876, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$876, DW_AT_decl_file("/opt/ti/bios_6_34_01_14/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$876, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$876, DW_AT_decl_column(0x11)
$C$DW$T$877	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Assert_Module__gateObj")
	.dwattr $C$DW$T$877, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$877, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$877, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$877, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$877, DW_AT_decl_column(0x11)
$C$DW$T$878	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Assert_Module__gatePrms")
	.dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$878, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$878, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$878, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$878, DW_AT_decl_column(0x11)
$C$DW$T$879	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Assert_Module__loggerObj")
	.dwattr $C$DW$T$879, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$879, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$879, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$879, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$879, DW_AT_decl_column(0x11)
$C$DW$T$880	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Assert_Object__table")
	.dwattr $C$DW$T$880, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$880, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$880, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$880, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$880, DW_AT_decl_column(0x11)
$C$DW$T$881	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Diags_Module__gateObj")
	.dwattr $C$DW$T$881, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$881, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$881, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$881, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$881, DW_AT_decl_column(0x11)
$C$DW$T$882	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Diags_Module__gatePrms")
	.dwattr $C$DW$T$882, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$882, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$882, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$882, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$T$882, DW_AT_decl_column(0x11)
$C$DW$T$883	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Diags_Module__loggerObj")
	.dwattr $C$DW$T$883, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$883, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$883, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$883, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$T$883, DW_AT_decl_column(0x11)
$C$DW$T$884	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Diags_Object__table")
	.dwattr $C$DW$T$884, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$884, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$884, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$884, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$884, DW_AT_decl_column(0x11)
$C$DW$T$885	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Error_Module__gateObj")
	.dwattr $C$DW$T$885, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$885, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$885, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$885, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$885, DW_AT_decl_column(0x11)
$C$DW$T$886	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Error_Module__gatePrms")
	.dwattr $C$DW$T$886, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$886, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$886, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$886, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$886, DW_AT_decl_column(0x11)
$C$DW$T$887	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Error_Module__loggerObj")
	.dwattr $C$DW$T$887, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$887, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$887, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$887, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$887, DW_AT_decl_column(0x11)
$C$DW$T$888	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Error_Object__table")
	.dwattr $C$DW$T$888, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$888, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$888, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$888, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$888, DW_AT_decl_column(0x11)
$C$DW$T$889	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Log_Module__gateObj")
	.dwattr $C$DW$T$889, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$889, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$889, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$889, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$889, DW_AT_decl_column(0x11)
$C$DW$T$890	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Log_Module__gatePrms")
	.dwattr $C$DW$T$890, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$890, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$890, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$890, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$890, DW_AT_decl_column(0x11)
$C$DW$T$891	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Log_Module__loggerObj")
	.dwattr $C$DW$T$891, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$891, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$891, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$891, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$891, DW_AT_decl_column(0x11)
$C$DW$T$892	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Log_Object__table")
	.dwattr $C$DW$T$892, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$892, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$892, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$892, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$T$892, DW_AT_decl_column(0x11)
$C$DW$T$893	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Module__gateObj")
	.dwattr $C$DW$T$893, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$893, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$893, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$893, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$893, DW_AT_decl_column(0x11)
$C$DW$T$894	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Module__gatePrms")
	.dwattr $C$DW$T$894, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$894, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$894, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$894, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$T$894, DW_AT_decl_column(0x11)
$C$DW$T$895	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Module__loggerObj")
	.dwattr $C$DW$T$895, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$895, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$895, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$895, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$895, DW_AT_decl_column(0x11)
$C$DW$T$896	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Object__table")
	.dwattr $C$DW$T$896, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$896, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$896, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$896, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$896, DW_AT_decl_column(0x11)
$C$DW$T$897	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Main_Module__gateObj")
	.dwattr $C$DW$T$897, DW_AT_type(*$C$DW$T$252)
	.dwattr $C$DW$T$897, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$897, DW_AT_decl_file("/opt/ti/xdctools_3_24_02_30/packages/xdc/runtime/Main.h")
	.dwattr $C$DW$T$897, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$897, DW_AT_decl_column(0x11)
$C$DW$T$898	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Main_Module__gatePrms")
	.dwattr $C$DW$T$898, DW_AT_type(*$C$DW$T$252)
